Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_certificate_manager_dns_authorization.domains["localmail.broadinstitute.org"] will be destroyed
  # (because key ["localmail.broadinstitute.org"] is not in for_each map)
- resource "google_certificate_manager_dns_authorization" "domains" {
-       description         = "DNS authorization for localmail.broadinstitute.org" -> null
-       dns_resource_record = [
-           {
-               data = "ebdd3eb4-7a82-467c-90f8-881a46b48059.2.authorize.certificatemanager.goog."
-               name = "_acme-challenge_bn33jnmenbxynmcq.localmail.broadinstitute.org."
-               type = "CNAME"
            },
        ] -> null
-       domain              = "localmail.broadinstitute.org" -> null
-       effective_labels    = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       id                  = "projects/broad-redirect-prod/locations/global/dnsAuthorizations/localmail-broadinstitute-org" -> null
-       labels              = {} -> null
-       location            = "global" -> null
-       name                = "localmail-broadinstitute-org" -> null
-       project             = "broad-redirect-prod" -> null
-       terraform_labels    = {
-           "goog-terraform-provisioned" = "true"
        } -> null
-       type                = "PER_PROJECT_RECORD" -> null
    }

  # google_certificate_manager_dns_authorization.domains["www.localmail.broadinstitute.org"] will be created
+ resource "google_certificate_manager_dns_authorization" "domains" {
+       description         = "DNS authorization for www.localmail.broadinstitute.org"
+       dns_resource_record = (known after apply)
+       domain              = "www.localmail.broadinstitute.org"
+       effective_labels    = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                  = (known after apply)
+       location            = "global"
+       name                = "www-localmail-broadinstitute-org"
+       project             = "broad-redirect-prod"
+       terraform_labels    = {
+           "goog-terraform-provisioned" = "true"
        }
+       type                = "PER_PROJECT_RECORD"
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["broad.harvard.edu"] will be created
+ resource "google_certificate_manager_certificate" "certificates" {
+       description      = "Certificate for broad.harvard.edu"
+       effective_labels = {
+           "goog-terraform-provisioned" = "true"
        }
+       id               = (known after apply)
+       location         = "global"
+       name             = "broad-harvard-edu-1d59e983"
+       project          = "broad-redirect-prod"
+       san_dnsnames     = (known after apply)
+       terraform_labels = {
+           "goog-terraform-provisioned" = "true"
        }

+       managed {
+           authorization_attempt_info = (known after apply)
+           dns_authorizations         = [
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/broad-harvard-edu",
+               "projects/broad-redirect-prod/locations/global/dnsAuthorizations/www-broad-harvard-edu",
            ]
+           domains                    = [
+               "broad.harvard.edu",
+               "www.broad.harvard.edu",
            ]
+           provisioning_issue         = (known after apply)
+           state                      = (known after apply)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate.certificates["redirect.broadinstitute.org"] must be replaced
-/+ resource "google_certificate_manager_certificate" "certificates" {
!       id               = "projects/broad-redirect-prod/locations/global/certificates/redirect-broadinstitute-org-1d59e983" -> (known after apply)
-       labels           = {} -> null
        name             = "redirect-broadinstitute-org-1d59e983"
!       san_dnsnames     = [
-           "redirect.broadinstitute.org",
-           "localmail.broadinstitute.org",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

!       managed {
!           authorization_attempt_info = [
-               {
-                   domain         = "redirect.broadinstitute.org"
-                   state          = "AUTHORIZED"
                    # (2 unchanged attributes hidden)
                },
-               {
-                   domain         = "localmail.broadinstitute.org"
-                   state          = "AUTHORIZED"
                    # (2 unchanged attributes hidden)
                },
            ] -> (known after apply)
!           dns_authorizations         = [
-               "projects/993744606360/locations/global/dnsAuthorizations/redirect-broadinstitute-org",
-               "projects/993744606360/locations/global/dnsAuthorizations/localmail-broadinstitute-org",
            ] -> (known after apply) # forces replacement
!           domains                    = [ # forces replacement
                "redirect.broadinstitute.org",
!               "localmail.broadinstitute.org" -> "www.localmail.broadinstitute.org",
            ]
!           provisioning_issue         = [] -> (known after apply)
!           state                      = "ACTIVE" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["broad.harvard.edu"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.harvard.edu"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "broad.harvard.edu"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "broad-harvard-edu-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["redirect.broadinstitute.org"] will be updated in-place
! resource "google_certificate_manager_certificate_map_entry" "certificates" {
!       certificates     = [
-           "projects/993744606360/locations/global/certificates/redirect-broadinstitute-org-1d59e983",
        ] -> (known after apply)
        id               = "projects/broad-redirect-prod/locations/global/certificateMaps/broadinstitute-org-1d59e983/certificateMapEntries/redirect-broadinstitute-org-1d59e983"
        name             = "redirect-broadinstitute-org-1d59e983"
        # (11 unchanged attributes hidden)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.broad.harvard.edu"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for broad.harvard.edu"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.broad.harvard.edu"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-broad-harvard-edu-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

  # module.http_redirects["broadinstitute-org"].module.certificates.google_certificate_manager_certificate_map_entry.certificates["www.localmail.broadinstitute.org"] will be created
+ resource "google_certificate_manager_certificate_map_entry" "certificates" {
+       certificates     = (known after apply)
+       create_time      = (known after apply)
+       description      = "Certificate map entry for redirect.broadinstitute.org"
+       effective_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       hostname         = "www.localmail.broadinstitute.org"
+       id               = (known after apply)
+       labels           = {
+           "acc-test"  = "true"
+           "terraform" = "true"
        }
+       map              = "broadinstitute-org-1d59e983"
+       name             = "www-localmail-broadinstitute-org-1d59e983"
+       project          = "broad-redirect-prod"
+       state            = (known after apply)
+       terraform_labels = {
+           "acc-test"                   = "true"
+           "goog-terraform-provisioned" = "true"
+           "terraform"                  = "true"
        }
+       update_time      = (known after apply)
    }

Plan: 6 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 6 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```